module seg7 (rstb, clk, DIGIT, SEG);

/*****************************************************
** 입력 신호 정의                       **
*****************************************************/
input    rstb        ;
input    clk       ;
  
/*****************************************************
** 출력 신호 정의                       **
*****************************************************/ 
output  reg [7:0]      DIGIT      ;
output  reg [6:0]      SEG  ;
       
/*****************************************************
** Reg 정의                             **
*****************************************************/
reg   [16:0]   clk_cnt    ;
reg  seg_clk;
/*****************************************************
** 7 Segment 자리 선택  Clock 생성 (500 Hz)
*****************************************************/
always @(posedge clk or negedge rstb) begin 
   if (!rstb) begin
      clk_cnt   <=  17'd0;
      seg_clk <= 0;  
      end
   else begin
      if (clk_cnt == 17'd99999) begin   // 정상동작시 선택
         clk_cnt     <= 17'd0;
         seg_clk <= ~seg_clk; 
         end
      else begin
         clk_cnt     <= clk_cnt + 1;
      end
   end
end

/*****************************************************
** 자리 선택 Clock에 따라 자리 이동
*****************************************************/
always @(posedge seg_clk or negedge rstb) begin 
   if (!rstb) begin
      DIGIT  <= 8'b1000_0000;  
      SEG  <= 7'd0;   
      end
            
   else begin
      DIGIT <= {DIGIT[0],DIGIT[7:1]}; 
       case(DIGIT)   // 선택한 자리에 원하는 숫자 데이타 출력
               8'b1000_0000 : SEG  <= 7'b011_0000;  // 1출력
               8'b0100_0000 : SEG  <= 7'b110_1101;  // 2출력
               8'b0010_0000 : SEG  <= 7'b111_1001;  // 3출력
               8'b0001_0000 : SEG  <= 7'b011_0011;  // 4출력
               8'b0000_1000 : SEG  <= 7'b101_1011;  // 5출력
               8'b0000_0100 : SEG  <= 7'b101_1111;  // 6출력
               8'b0000_0010 : SEG  <= 7'b111_0010;  // 7출력
               8'b0000_0001 : SEG  <= 7'b111_1111;  // 8출력
               default : SEG  <= 7'd0;
      endcase
   end
end


endmodule
